import express from 'express';
import { Client, Events, GatewayIntentBits, REST, Routes } from 'discord.js';
import dotenv from 'dotenv';

dotenv.config();

const app = express();
const port = process.env.PORT || 4000;

app.get('/', (req, res) => {
  res.send('Hello from Express!');
});

app.listen(port, () => {
  console.log(`Server is running on port ${port}`);
});

// Define the commands
const commands = [
  {
    name: 'ping',
    description: 'Replies with Pong!',
  },
  {
    name: 'menu',
    description: 'Random Food🍕',
  },
  {
    name: 'dessert-menu',
    description: 'Random Dessert🥞',
  },
  {
    name: 'about-debsirin-bot',
    description: 'Information about DS-BOT',
  },
];

// Register commands using REST API
const rest = new REST({ version: '10' }).setToken(process.env.TOKEN);

(async () => {
  try {
    console.log('Started refreshing application (/) commands.');
    
    // Register commands to the Discord API
    await rest.put(Routes.applicationCommands(process.env.CLIENT_ID), { body: commands });
    
    console.log('Successfully reloaded application (/) commands.');
  } catch (error) {
    console.error(error);
  }
})();

// Initialize the client
const client = new Client({ intents: [GatewayIntentBits.Guilds] });

// Define the menus
const menu = [
  "ข้าวผัด", "ผัดกะเพรา", "ผัดกะเพรากุ้ง", "ผัดผักบุ้ง", "ไข่เจียว", 
  "ลาบหมู", "น้ำตกหมู", "ไข่พะโล้", "เบอร์เกอร์", "พิซซ่า", 
  "หมูกรอบผัดพริกเกลือ", "ไก่ทอด", "ราเมง", "ไข่ดาว", "นม", 
  "KFC", "McDonalds", "Nobicha", "กุ้งอบวุ้นเส้น", "ไข่กระทะ", 
  "ข้าวมันไก่", "พาสต้า", "สปาเก็ตตี้คาโบนารา", "สปาเก็ตตี้ผัดขี้เมา", 
  "ส้มตำ", "คัตสึด้ง", "ลาซานญ่า", "ทงคัตสึ", "เกี้ยวซ่า", 
  "ทาโกะยากิ", "กุ้งเทมปุระ", "ยากิโทริ", "ข้าวขาหมู", "ข้าวแกงกะหรี่", 
  "ข้าวหมูแดง", "บะหมี่เกี๊ยว", "ยำวุ้นเส้น", "ปูผัดผงกระหรี่", 
  "ต้มยำกุ้ง", "หมูสะเต๊ะ", "ขนมจีน", "ข้าวเหนียวหมูปิ้ง", "ข้าวเกรียบปากหม้อ", 
  "ก๋วยเตี๋ยวเรือ", "ข้าวต้ม", "ข้าวพัซซ่า", "ทาร์ตไข่", "ขนมเบื้อง", 
  "พิซซ่าหน้าปู", "ข้าวสวย", "กุ้งอบซอส", "ทอดมันปลากราย", "ข้าวผัดปู", 
  "สเต๊กเนื้อ", "ชาบู", "ไก่ผัดพริกขี้หนู", "เกาเหลา", "ข้าวผัดกุ้ง", 
  "เนื้อย่าง", "หมูย่าง", "ไส้กรอก", "เกาเหลาหมู", "ข้าวคลุกกะปิ", 
  "สลัด", "สเต๊กหมู", "แฮมเบอร์เกอร์", "ไก่กรอบ", "แซนด์วิช", 
  "คาโบนาร่า", "กุ้งเผา", "ขนมจีนน้ำยา", "ข้าวเกรียบ", "ไข่เจียวหมูสับ", 
  "กะเพราหมู", "กะเพราหมูสับ", "ข้าวขาหมูสูตรพิเศษ", "ก๋วยจั๊บ", "ผัดไท", 
  "หมูชุปแป้งทอด", "กุ้งผัดพริกขี้หนู", "หมูย่างเกาหลี", "สลัดผลไม้", 
  "ข้าวผัดสับปะรด", "หมูหัน", "แกงเขียวหวาน", "ข้าวหมูปิ้ง", "ปีกไก่ทอด", 
  "ข้าวซอย", "ข้าวต้มปลา", "หมูกรอบ", "ข้าวมันไก่ทอด", "ต้มข่าไก่", 
  "ต้มยำปลากระพง", "ข้าวแช่", "ข้าวหมูหยอง", "หมูปิ้ง", "เนื้อวัวย่าง", 
  "ข้าวพะแนง", "ข้าวราดแกง", "ก๋วยเตี๋ยวคั่วไก่", "ก๋วยเตี๋ยวหมู", "ผัดเส้นหมี่", 
  "ส้มตำปูปลาร้า", "ข้าวห่อใบบัว", "ยำกุ้งสด", "ไก่ย่าง", "ทอดมันกุ้ง", 
  "ข้าวกล่อง", "ข้าวขาหมูโบราณ", "บาร์บีคิว", "หมูตุ๋น", "ไก่ทอดกรอบ", 
  "ก๋วยเตี๋ยวต้มยำ", "น้ำพริกปลาทู", "ข้าวเหนียวมะม่วง", "แกงเผ็ดไก่", 
  "น้ำตกเนื้อ", "สตูว์เนื้อ", "ไข่ต้ม", "สลัดกุ้ง", "ข้าวผัดกุ้ง", 
  "ข้าวปลา", "สตูว์ไก่", "ผัดซีอิ๊ว", "ข้าวพริกหยวก", "บิงซู", "ข้าวอบ",
  "สลัดปลาแซลมอน", "บะหมี่ไข่", "ข้าวมันไก่ทอดเกาหลี", "ข้าวผัดไข่เค็ม"
];

const dessertMenu = [
  "บิงซูสตรอว์เบอรรี", "บิงซูมะม่วง", "บิงซูแตงโม", "บิงซูเมลอน", 
  "บิงซูชาเขียว", "บราวนี่", "คุ้กกี้", "เค้กส้ม", "เค้กช็อกโกแลต", 
  "เค้กกาแฟ", "เค้กสตรอว์เบอร์รี", "ขนมจีบ", "ทาร์ตไข่", "ครัวซองต์", 
  "โดนัท", "คัพเค้ก", "ไอศกรีม", "ขนมเบื้อง", "ช็อกโกแลตฟองดู", 
  "พายแอปเปิ้ล", "ชีสเค้ก", "คุกกี้ช็อกโกแลตชิป", "พุดดิ้ง", 
  "มูสมะม่วง", "เครปเค้ก", "มัฟฟิน", "ช็อกโกแลตมูส", "ไอศกรีมชาเขียว", 
  "วาฟเฟิล", "เครป", "ไอศกรีมสตรอว์เบอร์รี", "คัสตาร์ด", "พายเลมอน", 
  "พายสตรอว์เบอร์รี", "คัพเค้กช็อกโกแลต", "บานอฟฟี่พาย", "พายมะพร้าว", 
  "พายฟักทอง", "ชีสเค้กสตรอว์เบอร์รี", "เบเกอรี่", "เค้กมะพร้าว", 
  "เค้กบลูเบอร์รี", "เค้กวนิลลา", "พายส้ม", "โรลเค้ก", "ไอศกรีมผลไม้", 
  "พัฟแป้ง", "ครีมบรูเล่", "โฟลต", "มิลค์เชค", "ฮันนี่โทสต์", "ทาร์ตมะพร้าว", 
  "ช็อกโกแลตเค้ก", "เค้กมะม่วง", "คุ้กกี้เนย", "เค้กมะพร้าวน้ำหอม", 
  "บัตเตอร์เค้ก", "บราวนี่ช็อกโกแลต", "คุกกี้โอ๊ต", "เค้กส้มโอ", 
  "ไอศกรีมโกโก้", "เค้กมะนาว", "เค้กกาแฟมอคค่า", "ขนมหวานญี่ปุ่น", 
  "ขนมทองหยอด", "ขนมลอยแก้ว", "ขนมบัวลอย", "ขนมต้มข้าวหลาม", 
  "ขนมกล้วยทอด", "ขนมเผือกทอด", "ขนมทับทิมกรอบ", "ขนมฝอยทอง", 
  "ขนมปังเนย", "เค้กงาดำ", "คุกกี้ข้าวโอ๊ต", "สตรอว์เบอร์รีชีสเค้ก", 
  "เค้กป๊อป", "ไอศกรีมกะทิ", "ขนมลูกชุบ", "เค้กฟรุ๊ตเค้ก", 
  "เค้กนมสด", "ขนมถั่วแปบ", "ขนมปังสังขยา", "ขนมกะละแม", "ขนมไหว้พระจันทร์"
];

// Client Ready Event
client.on(Events.ClientReady, readyClient => {
  console.log(`Logged in as ${readyClient.user.tag}!`);
});

// Interaction Create Event
client.on(Events.InteractionCreate, async interaction => {
  if (!interaction.isChatInputCommand()) return;

  if (interaction.commandName === 'menu') {
    await interaction.reply(menu[Math.floor(Math.random() * menu.length)]);
  }

  if (interaction.commandName === 'dessert-menu') {
    await interaction.reply(dessertMenu[Math.floor(Math.random() * dessertMenu.length)]);
  }

  if (interaction.commandName === 'about-debsirin-bot') {
    await interaction.reply('บอตเทพศิรินทร์ สร้างโดย PingzGP DSA139 IEP');
  }
});

// Login the bot
client.login(process.env.TOKEN);
