import { EmbedBuilder } from 'discord.js';

const ds_quotes = [
  "อย่าปล่อยให้อะไรๆ ก็เป็นเรื่องของอนาคต เพราะสิ่งที่กำหนดคือวันนี้",
  "Google ที่ว่าแน่ ยัง Search หาคู่แท้ไม่เจอเลย",
  "อย่าทำวันนี้ให้ดีที่สุด เดี๋ยวพรุ่งนี้ไม่มีอะไรทำ",
  "ทำข้อสอบอย่างมีสเตป คะแนนเลยออกมาเจ็บอย่างมีสไตล์",
  "เรื่องเรียนเป็นเรื่องตลก สอบตกเป็นเรื่องปกติ",
  "การบ้านไม่ทำ กิจกรรมไม่เด่น เน้นกลับบ้านเร็ว",
  "สอบมีสองอย่าง อ่านแทบไม่ได้นอน กับนอนแทบไม่ได้อ่าน",
  "เพราะการเรียนมันซีเรียส เลยคลายเครียดด้วยการกิน",
  "งานเลี้ยงย่อมมีวันเลิกรา อาจารย์เข้าช้า ไม่มีวันเลิกเร็ว",
  "เน้นเข้าเรียน แต่ไม่เข้าใจ",
  "ไม่ต้องเก่งเคมีมากมาย ก็รู้ว่าตัวทำละลายใจเราคือเธอ",
  "ความรักก็เหมือนข้อสอบ เราไม่ควรเลือกข้อที่ “ชอบ” แต่ควรเลือกข้อที่ “ใช่”",
  "คุณบอกเราเหมือนข้อสอบ เราเป็นคำตอบหรือเป็นตัวเลือก",
  "อ่านหนังสือจะได้ความรู้ แต่อ่านใจเราดูอะจะได้ความรัก",
  "เรียนวิชาการอาจจะเหนื่อย เรียนรู้กันไปเรื่อยๆ อาจจะรัก",
  "คณิตศาสตร์ง่ายนิดเดียว ที่เหลือยากหมด",
  "ฟิสิกส์ง่ายนิดเดียว ที่เหลือยากหมด",
  "เคมีง่ายนิดเดียว ที่เหลือยากหมด",
  "ชีวะง่ายนิดเดียว ที่เหลือยากหมด",
  "ฝรั่งเศสง่ายนิดเดียว ที่เหลือยากหมด",
  "เยอรมันง่ายนิดเดียว ที่เหลือยากหมด",
  "จีนง่ายนิดเดียว ที่เหลือยากหมด",
  "ญี่ปุ่นง่ายนิดเดียว ที่เหลือยากหมด",
  "วิชาไหนยาก ขอ Pass ไว้ก่อน",
  "อ่านหนังสือทั้งคืน สุดท้ายก็ลืมซะหมด",
  "เรียนออนไลน์ กายออนเบด",
  "ความรู้คืออาวุธ แต่ความสนุกคือพลัง",
  "สู้ต่อไป ทาเคชิ",
  "สอบตกไม่เป็นไร ขอแค่ใจยังไหวก็พอ",
  "กระดาษเปล่าในข้อสอบ คือคำตอบที่ใสสะอาด",
  "“ถึงแม้เราจะไปไม่ถึงฝั่งฝัน แต่เราจะอยู่ท่ามกลางหมู่ดาว” - ผอ.วิธาน"
];

export function getRandomQuotes() {
  const index = Math.floor(Math.random() * ds_quotes.length);
  return ds_quotes[index];
}

export async function handleQuotes(interaction, client) {
  client.user.setActivity('สุ่มคำคมบาดใจเด็กทศ ไม่ง้อหญิง', { type: 0 });

  const quote = getRandomQuotes();
  const embed = new EmbedBuilder()
    .setTitle('📜 คำคมบาดใจเด็กทศ')
    .setDescription(`"${quote}"`)
    .setColor('#FFC300')
    .setTimestamp();

  await interaction.reply({ embeds: [embed] });

  setTimeout(() => {
    client.user.setActivity('รอรับคำสั่งจากเด็กเทพศิรินทร์', { type: 3 });
  }, 3000);
}