import { EmbedBuilder } from 'discord.js';

const drinksMenu = [
  "ชาไทย", "ชาเขียว", "ชาดำเย็น", "ชามะนาว", "ชานมไข่มุก",
  "ชาพีช", "ชาเบอร์รี", "ชาเขียวมัทฉะ", "ชาเก๊กฮวย", "ชาใบบัวบก",
  "กาแฟเย็น", "กาแฟดำ", "อเมริกาโน่", "ลาเต้", "คาปูชิโน่",
  "มอคค่า", "เอสเปรสโซ่", "กาแฟมะพร้าว", "กาแฟนมสด", "กาแฟน้ำผึ้งมะนาว",
  "โกโก้เย็น", "โกโก้ร้อน", "โกโก้ปั่น", "ไมโลเย็น", "ไมโลภูเขาไฟ",
  "โอวัลตินเย็น", "นมเย็น", "นมชมพู", "นมเผือก", "นมสดร้อน",
  "นมสดปั่น", "นมสดคาราเมล", "นมสดน้ำผึ้ง", "นมเปรี้ยว", "โยเกิร์ตปั่น",
  "สมูทตี้ผลไม้รวม", "สมูทตี้มะม่วง", "สมูทตี้สตรอว์เบอร์รี", "สมูทตี้กล้วย",
  "น้ำส้มคั้น", "น้ำมะนาว", "น้ำแตงโมปั่น", "น้ำฝรั่ง", "น้ำแครอท",
  "น้ำมะพร้าว", "น้ำอัญชันมะนาว", "น้ำใบเตย", "น้ำลิ้นจี่", "น้ำองุ่น",
  "โซดาน้ำผึ้งมะนาว", "โซดาสตอเบอร์รี", "โซดาบลูฮาวาย", "โซดากีวี", "โซดาแอปเปิ้ลเขียว",
  "โซดาองุ่น", "น้ำผึ้งมะนาว", "น้ำมะตูม", "น้ำกระเจี๊ยบ", "น้ำตะไคร้",
  "น้ำขิง", "น้ำขิงนมสด", "น้ำมะขาม", "น้ำเสาวรส", "น้ำแตงไทย",
  "น้ำกล้วยหอมปั่น", "น้ำสับปะรด", "น้ำทับทิม", "น้ำลูกหม่อน", "น้ำส้มยูสุ",
  "น้ำแอปเปิ้ล", "น้ำเชอร์รี่", "น้ำกีวี", "น้ำองุ่นโซดา", "น้ำบลูเบอร์รี",
  "นมกล้วย", "นมอัลมอนด์", "นมข้าวโพด", "นมถั่วเหลือง", "นมสดชาเขียว",
  "ชาเขียวมะลิ", "ชาแอปเปิ้ล", "ชาแครนเบอร์รี", "ชาเสาวรส", "คาราเมลมัคคิอาโต้",
  "เครมบรูเล่ลาเต้", "โกโก้มิ้นต์", "โกโก้กล้วย", "นมสดบราวชูการ์", "นมสดโอรีโอ้",
  "นมสดคุกกี้แอนด์ครีม", "กาแฟเย็นโอเลี้ยง", "อิตาเลียนโซดา", "อิตาเลียนโซดาบลูเลมอน",
  "อิตาเลียนโซดาแดง", "อิตาเลียนโซดาเขียว", "คาราเมลโซดา", "สตรอว์เบอร์รีนมสด",
  "กล้วยนมสด", "โกโก้คาราเมล", "ลิ้นจี่กุหลาบโซดา", "เสาวรสโซดา"
];

export function getRandomDrinks() {
  const index = Math.floor(Math.random() * drinksMenu.length);
  return drinksMenu[index];
}

export async function handleDrinksMenu(interaction, client) {
  client.user.setActivity('สุ่มเมนูเครื่องดื่ม', { type: 0 });

  const drink = getRandomDrinks();
  const embed = new EmbedBuilder()
    .setTitle('🍹 เครื่องดื่ม :')
    .setDescription(`**${drink}**`)
    .setColor('#FF66CC')
    .setTimestamp();

  await interaction.reply({ embeds: [embed] });

  setTimeout(() => {
    client.user.setActivity('รอรับคำสั่งจากเด็กเทพศิรินทร์', { type: 3 });
  }, 3000);
}